{
  "nav": {
    "skillsExperience": "Habilidades y Experiencia",
    "projects": "Proyectos",
    "aboutMe": "Sobre Mí",
    "contact": "Contacto",
    "langMenu": {
      "english": "Inglés",
      "spanish": "Español"
    }
  },
  "landingPage": {
    "heroTitle": "Hola, soy Nelly",
    "heroText": "Soy una desarrolladora apasionada en front-end, pero también he hecho mis aportes como desarrolladora fullstack. Transformo ideas en soluciones reales y creativas. Tengo más de 8 años de experiencia en la industria tecnológica. Disfruto del proceso de convertir ideas en algo más grande. Espero colaborar contigo para hacer realidad tus aspiraciones."
  },
  "services": {
    "title": "Servicios",
    "serviceList": [
      {
        "title": "Desarrollo Escalable de Componentes UI",
        "description": "Construcción de componentes de interfaz de usuario modulares y reutilizables, diseñados para ofrecer alto rendimiento y facilidad de mantenimiento a largo plazo."
      },
      {
        "title": "Servicios de Integración de APIs",
        "description": "Conexión fluida de aplicaciones frontend con APIs RESTful o GraphQL para interfaces dinámicas y orientadas a datos."
      },
      {
        "title": "Integración de Pruebas Unitarias",
        "description": "Implementación de marcos de pruebas unitarias robustos para garantizar la calidad del código y reducir errores regresivos."
      },
      {
        "title": "Optimización del Rendimiento de Aplicaciones Web",
        "description": "Mejora de tiempos de carga, capacidad de respuesta y métricas clave del rendimiento mediante optimizaciones específicas del frontend."
      },
      {
        "title": "Corrección de Errores y Mejora de Componentes",
        "description": "Identificación y resolución de errores en la interfaz, junto con mejoras a componentes existentes para adaptarse a nuevas necesidades y mejorar la experiencia del usuario."
      },
      {
        "title": "Desarrollo de Sistemas de Diseño Web y Guías de Estilo",
        "description": "Creación de sistemas de diseño y guías de estilo coherentes y escalables que unifican la identidad visual y los estándares de interfaz."
      },
      {
        "title": "Rediseño de Arquitectura Frontend",
        "description": "Reestructuración de la arquitectura de la aplicación para mejorar la escalabilidad, claridad del código y colaboración entre equipos."
      }
    ]
  },
  "skillsExperience": {
    "title": "Habilidades & Experiencia",
    "paragraph1": "La siguiente sección destaca mis principales habilidades técnicas y áreas de especialización, desarrolladas a través de experiencia práctica en desarrollo web y crecimiento profesional continuo.",
    "companies": [
      {
        "name": "360Training",
        "startDate": "06/2024",
        "endDate": "11/2024",
        "description": "Colaboración con la modernización de un sistema de gestión de aprendizaje utilizando las siguientes herramientas: React.js, ASP.NET Core, microservicios, SQL Server, Docker y Azure Cloud."
      },
      {
        "name": "Fiserv",
        "startDate": "10/2012",
        "endDate": "12/2021",
        "description": "Colaboración ​​​​en el desarrollo integral para proyectos de servicios financieros, brindando soluciones de alta calidad utilizando las siguientes herramientas: ASP.NET MVC, C#, REST, HTML, CSS3, Less, jQuery y JavaScript."
      },
      {
        "name": "Mnet",
        "startDate": "11/2011",
        "endDate": "10/20212",
        "description": "Colaboración con implementaciones en el área de frontend (ASP.NET, C#, CSS, HTML, jQuery), y backend (Web Services, SQL Server) orientadas a servicios de e-commerce."
      },
      {
        "name": "A&B Technology Solutions",
        "startDate": "10/2010",
        "endDate": "05/2011",
        "description": "Colaboración con implemenatciones en el área de frontend (ASP.NET, Visual Basic, CSS, HTML, Javascript), y backend (Web Services, SQL Server) orientadas a servicios de salud."
      }
    ]
  },
  "projects": {
    "title": "Proyectos",
    "paragraph1": "Proyectos que equilibran usabilidad y estructura con la curiosidad por aprender y experimentar con diferentes herramientas.",
    "projectList": [
      {
        "title": "BookStore App",
        "description": "Pequeña aplicación de libros con gestión de usuarios y sistema de búsqueda de libros.",
        "tag": "Proyecto"
      },
      {
        "title": "Calendar App",
        "description": "Aplicación de calendario para realizar un seguimiento de tus citas.",
        "tag": "Proyecto"
      },
      {
        "title": "Kap App",
        "description": "Actualización de la interfaz de usuario para el sitio web de terapia curativa.",
        "tag": "Proyecto"
      },
      {
        "title": "Admin App",
        "description": "Plantilla de estructura de proyecto para aplicaciones frontend monolíticas escalable.",
        "tag": "Proyecto"
      },
      {
        "title": "Microfrontend App",
        "description": "Esta aplicación de prueba explora la arquitectura de microfrontend con React JS, centrándose en cuellos de botella comunes como dependencias compartidas, comunicación de módulos y desafíos de implementación.",
        "tag": "Caso de Uso"
      },
      {
        "title": "Explorando Panda CSS",
        "description": "Building a test app to explore Panda CSS and evaluate whether it's suitable for creating a maintainable style guide.",
        "tag": "Caso de Uso"
      }
    ],
    "btnLabel": "Explorar"
  },
  "aboutMe": {
    "title": "Sobre Mí",
    "paragraph1": "Hola, soy ingeniera de software con más de 8 años de experiencia ayudando a compañías a resolver problemas complejos mediante soluciones inteligentes y orientadas a resultados.",
    "paragraph2": "A lo largo de mi carrera, he trabajado en proyectos de servicios financieros, e-learning y con equipos pequeños y grandes. Mi enfoque se basa en la estrategia, la colaboración y un profundo conocimiento de las necesidades de los usuarios y los objetivos del negocio.",
    "paragraph3": "Me apasiona ofrecer excelencia, aprendizaje continuo y crear un trabajo que no solo sea eficaz, sino también duradero. Ya sea optimizando un producto, escalando un sistema o construyendo una producto desde cero, aporto claridad y compromiso a cada etapa del proceso."
  },
  "contact": {
    "title": "Contacto",
    "paragraph1": "Siempre estoy abierta a nuevas oportunidades, colaboraciones creativas o simplemente conectarme con personas con ideas afines.",
    "paragraph2": "Si estás interesado en trabajar juntos, tienes un proyecto en mente o simplemente quieres saludar, no dudes en comunicarte con nosotros."
  },
  "footer": {
    "copyright": "Todos los derechos reservados"
  }
}
